tap "dopplerhq/cli"
tap "github/gh"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "tj/mmake", "https://github.com/tj/mmake.git"
tap "universal-ctags/universal-ctags"
tap "wez/wezterm"
brew "little-cms2"
brew "asdf"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "black"
brew "checkmake"
brew "direnv"
brew "dog"
brew "dotenv-linter"
brew "dust"
brew "editorconfig-checker"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gitlint"
brew "glances"
brew "glib"
brew "glow"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gping"
brew "hadolint"
brew "helm"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "luacheck", link: false
brew "macos-trash"
brew "mas"
brew "navi"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "ngrep"
brew "pastel"
brew "pre-commit"
brew "reorder-python-imports"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "sloccount"
brew "sqlfluff"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "yamllint"
brew "yapf"
brew "zoxide"
brew "dopplerhq/cli/doppler", link: false
brew "tj/mmake/mmake"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "brave-browser", args: { appdir: "~/Applications" }
cask "discord", args: { appdir: "~/Applications" }
cask "docker", args: { appdir: "~/Applications" }
cask "font-hack-nerd-font"
cask "ngrok"
cask "postman", args: { appdir: "~/Applications" }
cask "rectangle", args: { appdir: "~/Applications" }
cask "wezterm"
mas "Fantastical", id: 975937182
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "TickTick", id: 966085870
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
