brew 'asdf'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'black'
brew 'checkmake'
brew 'coreutils'
brew 'direnv'
brew 'docutils'
brew 'doggo'
brew 'dotenv-linter'
brew 'dust'
brew 'editorconfig-checker'
brew 'entr'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gitlint'
brew 'glances'
brew 'glib'
brew 'glow'
brew 'gnupg'
brew 'gping'
brew 'hadolint'
brew 'helm'
brew 'hyperfine'
brew 'libheif'
brew 'imagemagick'
brew 'jq'
brew 'lazygit'
brew 'luacheck'
brew 'mas'
brew 'navi'
brew 'neovim', args: ['HEAD']
brew 'ngrep'
brew 'node'
brew 'pastel'
brew 'pre-commit'
brew 'ripgrep'
brew 'ruff'
brew 'shellcheck'
brew 'sloccount'
brew 'sqlfluff'
brew 'starship'
brew 'stow'
brew 'tlrc'
brew 'tmux'
brew 'tree'
brew 'universal-ctags'
brew 'yamllint'
brew 'zoxide'
cask '1password-cli'
cask 'brave-browser'
cask 'discord'
cask 'font-fira-mono-for-powerline'
cask 'font-hack-nerd-font'
cask 'gcloud-cli'
cask 'ghostty'
cask 'ngrok'
cask 'postman', args: { appdir: '~/Applications' }
cask 'rectangle'
cask 'wezterm'
mas 'Fantastical', id: 975_937_182
mas 'ImageOne', id: 1_237_328_432
mas 'Numbers', id: 409_203_825
mas 'Okta Verify', id: 490_179_405
mas 'Telegram', id: 747_648_890
mas 'Vimari', id: 1_480_933_944
mas 'WhatsApp', id: 310_633_997
mas 'Xcode', id: 497_799_835
