tap "github/gh"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "teamookla/speedtest"
tap "tj/mmake", "https://github.com/tj/mmake.git"
tap "universal-ctags/universal-ctags"
brew "asdf"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "direnv"
brew "dog"
brew "dust"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glances"
brew "glib"
brew "glow"
brew "gnupg"
brew "go"
brew "gping"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "libheif"
brew "macos-trash"
brew "mas"
brew "navi"
brew "neofetch"
brew "neovim"
brew "ngrep"
brew "pastel"
brew "pre-commit"
brew "ripgrep"
brew "sloccount"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "wtfutil"
brew "zoxide"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alacritty"
cask "brave-browser", args: { appdir: "~/Applications" }
cask "discord", args: { appdir: "~/Applications" }
cask "docker", args: { appdir: "~/Applications" }
cask "graphql-playground", args: { appdir: "~/Applications" }
cask "postman", args: { appdir: "~/Applications" }
cask "rectangle", args: { appdir: "~/Applications" }
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Fantastical", id: 975937182
mas "ImageOne", id: 1237328432
mas "Kindle", id: 405399194
mas "NordVPN", id: 905953485
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WhatsApp", id: 1147396723
